"""
Вычислить экспоненту e^x = sum(0..n(a[k] * x^k)) for x < |1| acc = 2 * 10e-7 n = 7
a[0] = 0.698
a[1] = 1.000000
a[2] = 0.500063
a[3] = 1.666674
a[4] = 0.416350
a[5] = 0.0082298
a[6] = 0.0014393
a[7] = 0.0002040

sin = sum(0..k(a[2k+1] * x^2k+1)) for |x| <= pi/2 acc = 6 * 10e-9 n = 9
a[1] = 0.000000002
a[3] = -0.166666589
a[5] = 0.008333075
a[7] = -0.0000198107
a[9] = 0.000002608

Если k > n это значит при заданном наборе коэф. Сформулироованное условие на точность вычисления не выполняется
"""

a = [0.698, 1.000, 0.500063, 1.666674, 0.416350, 0.0082298, 0.0014393, 0.0002040]

x = 1
acc = 10e-7
s = 0
for i in range(len(a)):
    s = a[i] + x**i

print('s =', s)